{
    "ip address": {
        "pattern": "(how (do|can) i find my server ip address|where is the ip)",
        "response": "To locate your server IP address, log into your panel, select your server, and check the right section for the server IP address."
    },
    "pull files": {
        "pattern": "(how (do|can) i pull files|can i pull a file)",
        "response": "To pull a file, navigate to the Files tab, click on Pull File, then paste the URL and specify the location where you want the file to be pulled. Done!"
    },
    "changing server": {
        "pattern": "(how (do|can) i change my server type|how (do|can) i change my server jar)",
        "response": "To change your server type, go to the [Client Area](https://virtue-host.com/billing/login) and access your active product. Then, select the Upgrade/Download tab and choose the desired server type."
    },
    "changing java version": {
        "pattern": "(how (do|can) i change my server java type|how (do|can) i change my server server java version|how (do|can) i change my java version)",
        "response": "To change your server's Java version, navigate to the Startup tab, find the Docker Image section, click the drop-down menu, and select the desired Java version."
    },
    "changing build version": {
        "pattern": "(how (do|can) i change my server build version|i want to change my server build|how (do|can) i change my server build type)",
        "response": "To change your server build type, click on the Startup tab, view the Build Number section, and enter your build number."
    },
    "startup arguments": {
        "pattern": "(how (do|can) i change my server startup arguments|how (do|can) i change my server startup flags|how (do|can) i change my server server flags)",
        "response": "To change your server startup arguments, go to the Startup tab, locate the Startup Arguments section, and enter your desired startup arguments."
    },
    "mysql database": {
        "pattern": "(how (do|can) i create a mysql database|how (do|can) i create a database)",
        "response": "To create a MySQL database, navigate to the Database tab, click on New Database, and fill out the create database form."
    },
    "schedules": {
        "pattern": "(how (do|can) i create a schedule|how (do|can) i create a automated restart)",
        "response": "To create a schedule, go to the Schedule tab, click on Create Schedule, and follow the schedule creation guide."
    },
    "sub user": {
        "pattern": "(how (do|can) i create a sub user|how (do|can) i create a user|how to (make|create) a sub user)",
        "response": "To create a sub-user, go to the Users tab, click on New User, and fill out the user's email. Below the email, you can select permissions for the user across various categories of server management. Afterward, click Invite User. The user will receive an email with a link that grants them access to create a password for the panel once clicked."
    },
    "backups": {
        "pattern": "(how (do|can) i create a backup|how (do|can) i backup|how to backup (my|the) server)",
        "response": "To create a backup, go to the Backups tab, click on New Backup. You can then name your backup, choose directories to ignore, lock the backup from being deleted if desired, and finally, click Start Backup."
    },
    "allocations": {
        "pattern": "(how (do|can) i create an allocation|how (do|can) i create an additional port|how (do|can) i create an extra port)",
        "response": "To create an allocation for additional ports, navigate to the Allocations tab and click on New Allocation."
    },
    "ftp": {
        "pattern": "(how (do|can) i use SFTP|how (do|can) i use FTP|how (do|can) i use Filezilla)",
        "response": "You can find your server's SFTP credentials by clicking on the Settings tab, navigating to the SFTP Details section, and copying your SFTP credentials from there."
    },
    "reinstall": {
        "pattern": "(how (do|can) i reinstall my server|how (do|can) i reinstall my files|how (do|can) i reinstall)",
        "response": "You can reinstall your server files by clicking on the Settings tab, then navigating to the Reinstall Server section, and finally clicking on Reinstall Server. It's important to note that reinstalling without deleting files in the Files tab will only update and repair game versions, build types, etc."
    },
    "server pfp": {
        "pattern": "(how (do|can) i make a server pfp|how (do|can) i make a server icon)",
        "response": "You can check out a brief knowledge article on how to do so [here](https://virtue-host.com/billing/knowledgebase/110/)."
    },
    "unzip": {
        "pattern": "(how (do|can) i unzip a folder|how (do|can) i unzip a file)",
        "response": "You can unzip a folder by right-clicking on the folder and selecting 'Extract' or 'Unarchive'."
    },
    "upgrade package": {
        "pattern": "(how (do|can) i upgrade my server package|how (do|can) i upgrade|how (do|can) i upgrade my server|how to upgrade my server)",
        "response": "To upgrade your server package, log in to your client area, navigate to your services, select the server you wish to upgrade, click on the upgrade/downgrade tab, and choose the package you want to upgrade to."
    },
    "downgrade package": {
        "pattern": "(how (do|can) i downgrade my server package|how (do|can) i downgrade my downgrade package|how (do|can) i downgrade my downgrade server)",
        "response": "To downgrade your server package, log in to your client area, navigate to your services, select the server you wish to downgrade, click on the upgrade/downgrade tab, and choose the package you want to downgrade to."
    },
    "cancel service": {
        "pattern": "(how (do|can) i cancel my service|how (do|can) i cancel server|how (do|can) i cancel subscription)",
        "response": "To cancel your service, log in to your client area, navigate to your services, select the service you want to cancel, select Request Cancellation and follow the cancellation instructions provided."
    },
    "billing issues": {
        "pattern": "(how (do|can) i resolve billing issues|i have billing problems|how (do|can) i contact billing support)",
        "response": "For billing issues, please contact our billing support team through the client area by opening a support ticket."
    },
    "server logs": {
        "pattern": "(how (do|can) i check my server logs|how (do|can) i view server logs|how (do|can) i access server logs)",
        "response": "You can check your server logs by navigating to the Logs folder in your server panel's Files tab."
    },
    "server status": {
        "pattern": "(how (do|can) i check my server status|how (do|can) i check server status)",
        "response": "You can check your server status by going to the Console tab in your server panel."
    },
    "plugin installation": {
        "pattern": "(how (do|can) i install plugins|how (do|can) i install plugin|how (do|can) i add plugin)",
        "response": "To install plugins, navigate to the Files tab in your server panel, select the plugins folder, and then either drag and drop the plugin files, use the pull files button, or click the upload button."
    },
    "mod installation": {
        "pattern": "(how (do|can) i install mods|how (do|can) i install mod|how (do|can) i add mod)",
        "response": "To install mods, go to the More tab in your server panel, click on the Modpacks button, choose your preferred mod provider, and then select the version of the mod you want to download."
    },
    "control panel": {
        "pattern": "(how (do|can) i access the control panel|how (do|can) i access control panel|how (do|can) i access panel access)",
        "response": "You can access the control panel by logging into [Game Panel](https://gp.virtue-host.com/)."
    },
    "crashing": {
        "pattern": "((my|the) server is crashing|(my|the) server keeps crashing|(my|the) server crashed)",
        "response": "Please open a ticket: https://discord.com/channels/1199932651931435009/1203291771749269534"
    },
    "reset end": {
        "pattern": "(how (do|can) i reset the end|how (do|can) i reset the end world)",
        "response": "You can reset the End world for Modded servers by visiting the Files tab, navigating to the World folder, and deleting the DIM1 folder. For Java servers, you can delete the World_the_end folder in the Files tab."
    },
    "datapacks": {
        "pattern": "(how (do|can) i install datapacks|how (do|can) i install datapack)",
        "response": "You can install datapacks by visiting the Files tab, navigating to the World folder, then the Datapacks folder, and simply uploading the .zip file of your datapack."
    }
}
